src/main/resources/addreq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:addMovieRequest>
         <gs:name>Four</gs:name>
         <gs:length>123</gs:length>
         <gs:mark>123</gs:mark>
      </gs:addMovieRequest>
   </soapenv:Body>
</soapenv:Envelope>